runs/case_09/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
612270
(
(6.6025 0.000642896 0.000263695)
(6.60164 -0.00119491 -0.00143211)
(6.5995 -0.000924221 -0.000837282)
(6.59996 -0.00171559 -0.00127762)
(6.59797 -0.00130639 -0.000971824)
(6.59829 -0.000678705 -0.000756297)
(6.59879 -0.000513029 -0.000653855)
(6.59876 0.000238531 -0.000351327)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (6.6 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    sides
    {
        type            slip;
    }
    symmetry
    {
        type            symmetryPlane;
    }
    tailfin
    {
        type            noSlip;
    }
}


// ************************************************************************* //
